import 'package:flutter/material.dart';
import 'package:google_mobile_ads/google_mobile_ads.dart';
import 'package:maharat_jazb_alnisa/main.dart'; // تأكد من أن BannerAdWidget معرف هنا

// --- هذا هو الكود الفعلي لـ BannerAdWidget المُعدّل ---
class BannerAdWidget extends StatefulWidget {
  const BannerAdWidget({super.key});

  @override
  State<BannerAdWidget> createState() => _BannerAdWidgetState();
}

class _BannerAdWidgetState extends State<BannerAdWidget> {
  BannerAd? _bannerAd;
  bool _isAdLoaded = false;
  final String _adUnitId = 'ca-app-pub-8081293973220877/5841556409'; // غير هذا بـ Ad Unit ID الخاص بإعلان البانر

  @override
  void initState() {
    super.initState();
    _loadBannerAd();
  }

  void _loadBannerAd() async {
    // *هذا هو الجزء الذي تم تعديله*
    // نستخدم getAnchoredAdaptiveBannerAdSize لحساب حجم الإعلان التكيفي
    final AdSize? size = await AdSize.getAnchoredAdaptiveBannerAdSize(
      MediaQuery.of(context).orientation,
      MediaQuery.of(context).size.width.truncate(),
    );

    if (size == null) {
      debugPrint('Unable to get adaptive banner size.');
      return;
    }

    _bannerAd = BannerAd(
      adUnitId: _adUnitId,
      request: const AdRequest(),
      size: size,
      listener: BannerAdListener(
        onAdLoaded: (ad) {
          debugPrint('BannerAd loaded.');
          setState(() {
            _isAdLoaded = true;
          });
        },
        onAdFailedToLoad: (ad, err) {
          debugPrint('BannerAd failed to load: $err');
          ad.dispose();
        },
      ),
    );
    _bannerAd!.load();
  }

  @override
  void dispose() {
    _bannerAd?.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) {
    if (_isAdLoaded && _bannerAd != null) {
      return SizedBox(
        width: _bannerAd!.size.width.toDouble(),
        height: _bannerAd!.size.height.toDouble(),
        child: AdWidget(ad: _bannerAd!),
      );
    } else {
      return const SizedBox.shrink();
    }
  }
}
// ------------------------------------------

class BuildAttractionPage extends StatefulWidget {
  const BuildAttractionPage({super.key});

  @override
  _BuildAttractionPageState createState() => _BuildAttractionPageState();
}

class _BuildAttractionPageState extends State<BuildAttractionPage> {
  double _fontSize = 16.0;

  // تعريف الإعلانات المدمجة
  NativeAd? _nativeAd1;
  NativeAd? _nativeAd2;

  bool _isNativeAd1Loaded = false;
  bool _isNativeAd2Loaded = false;

  final String adUnitId = 'ca-app-pub-8081293973220877/5104529502';

  @override
  void initState() {
    super.initState();
    // تحميل الإعلانات المدمجة عند تهيئة الصفحة
    _loadNativeAd1();
    _loadNativeAd2();
  }

  // دوال لتحميل الإعلانات المدمجة
  void _loadNativeAd1() {
    _nativeAd1 = NativeAd(
      adUnitId: adUnitId,
      factoryId: 'listTile',
      request: const AdRequest(),
      listener: NativeAdListener(
        onAdLoaded: (ad) {
          setState(() {
            _isNativeAd1Loaded = true;
          });
        },
        onAdFailedToLoad: (ad, error) {
          _nativeAd1?.dispose();
        },
      ),
    )..load();
  }

  void _loadNativeAd2() {
    _nativeAd2 = NativeAd(
      adUnitId: adUnitId,
      factoryId: 'listTile',
      request: const AdRequest(),
      listener: NativeAdListener(
        onAdLoaded: (ad) {
          setState(() {
            _isNativeAd2Loaded = true;
          });
        },
        onAdFailedToLoad: (ad, error) {
          _nativeAd2?.dispose();
        },
      ),
    )..load();
  }

  void _increaseFontSize() {
    setState(() {
      _fontSize = _fontSize + 2.0 < 24.0 ? _fontSize + 2.0 : 24.0;
    });
  }

  void _decreaseFontSize() {
    setState(() {
      _fontSize = _fontSize - 2.0 > 12.0 ? _fontSize - 2.0 : 12.0;
    });
  }

  @override
  void dispose() {
    _nativeAd1?.dispose();
    _nativeAd2?.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: PreferredSize(
        preferredSize: const Size.fromHeight(80.0),
        child: AppBar(
          backgroundColor: Colors.pink.shade100,
          automaticallyImplyLeading: false,
          flexibleSpace: SafeArea(
            child: Padding(
              padding: const EdgeInsets.symmetric(horizontal: 12.0, vertical: 8.0),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: [
                      Directionality(
                        textDirection: TextDirection.ltr,
                        child: IconButton(
                          icon: const Icon(Icons.arrow_back, color: Colors.black87),
                          onPressed: () {
                            Navigator.pop(context);
                          },
                        ),
                      ),
                      Expanded(
                        child: Text(
                          'بناء الجاذبيه',
                          style: TextStyle(
                            fontFamily: 'Amiri',
                            fontSize: 16,
                            fontWeight: FontWeight.bold,
                            color: Colors.black87,
                          ),
                          textAlign: TextAlign.right,
                          textDirection: TextDirection.rtl,
                          maxLines: 2,
                        ),
                      ),
                      const SizedBox(width: 10),
                    ],
                  ),
                ],
              ),
            ),
          ),
        ),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: Column(
          children: [
            Align(
              alignment: Alignment.topLeft,
              child: Padding(
                padding: const EdgeInsets.symmetric(horizontal: 16.0, vertical: 8.0),
                child: Container(
                  decoration: BoxDecoration(
                    color: Colors.pink.shade50,
                    borderRadius: BorderRadius.circular(10),
                    border: Border.all(color: Colors.pink.shade200),
                  ),
                  child: Row(
                    mainAxisSize: MainAxisSize.min,
                    children: [
                      IconButton(
                        icon: Icon(Icons.zoom_in, color: Colors.pink.shade700),
                        onPressed: _increaseFontSize,
                      ),
                      IconButton(
                        icon: Icon(Icons.zoom_out, color: Colors.pink.shade700),
                        onPressed: _decreaseFontSize,
                      ),
                    ],
                  ),
                ),
              ),
            ),
            Expanded(
              child: SingleChildScrollView(
                padding: const EdgeInsets.all(20.0),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      '''
يبدأ بناء الجاذبية من لقاء التعارف الأول.

#### لغة الجسد
الاقتراب من الفتاة يجب أن يتم من الأمام (فالنساء تخشى من أي اقتراب من الخلف)، وعندما تصبح على مقربة مناسبة منها، يجب أن تنعطف قليلاً، لتشكل وقفتك مع وقفتها زاوية ٤٥ درجة، حيث يشعر هذا الوضع الفتاة بمزيد من الحرية، وعدم وجود ضغط عليها، فيما يعتبر الوقوف مع الفتاة في اللقاء الأول وجهًا لوجه تضييق على الفتاة وإغلاق لطريقها، مما قد يشعرها بالخوف. قف على مسافة مناسبة من الفتاة، ولا تدخل في مساحتها الشخصية، وإذا ما تحركت هي للخلف قليلاً، فلا تخطو أنت للأمام. قف وساقاك متباعدتان، ومنطقة تشعب الرجلين ظاهرة، إحدى القدمين يحبذ أن تكون أمام الأخرى، وتميل شيئًا ما باتجاه موضع وقوف الفتاة، افتح ذراعيك ودع يديك تتدليان بحرية، لا تشبك يديك ببعضهما أمام صدرك، الكثير من الشبان يضعون أيديهم عاليًا بحيث تصبح حاجزًا بينهم وبين الفتاة، هذا الشيء يجب تجنبه، لا تدع رأسك يتدلى نحو الأرض، ارفع رأسك، أبقِ على جسدك منتصبًا مشدودًا، اسحب كتفيك إلى الخلف، أبرز صدرك إلى الأمام، بعبارة أخرى: خذ وضعية التصرف المسيطر التي شرحتها لك سابقًا.
''',
                      style: TextStyle(
                        fontFamily: 'Amiri',
                        fontSize: _fontSize,
                        height: 1.6,
                        color: Colors.black87,
                      ),
                      textAlign: TextAlign.justify,
                    ),
                    const SizedBox(height: 16.0),
                    Center(
                      child: Image.asset(
                        'assets/images/body_language_posture.jpg',
                        fit: BoxFit.contain,
                      ),
                    ),
                    const SizedBox(height: 16.0),
                    Text(
                      '''
اجعل وجهك بشوشًا منيرًا، ودع الابتسامة ترتسم عليه، واحرص على أن تبدي أسنانك بين الحين والآخر، حافظ على الاتصال بالعين، لكي تبني الألفة القوية مع الفتاة وتثير إعجابها، يجب أن تلتقي نظراتك بنظراتها ٦٠ إلى ٧٠ % من الوقت، لا تزح نظرك عنها قبل أن تزيح هي نظرها أولاً.
خلال المحادثة يتوجب عليك أن تبقى هادئًا مسترخي الأعصاب، هذا يعطيها الفرصة لقبولك بصورة أكبر، فالتوتر خلال اللقاء الأول ينتاب الفتاة أيضاً، وبقاء الشاب مرتاحًا هادئًا أثناء الحوار ينعكس بصورة إيجابية على الفتاة، ويعمل على امتصاص التوتر والاضطراب عندها.

#### أهمية النظر المطول والعميق في العيون، الابتسام، الوضعية المفتوحة للجسم:

1. أهمية النظر المطول والعميق في العيون:
* عندما ننظر في عيون الآخرين بصورة عميقة، فإن ذلك أشبه ما يكون بإعطاء الآخرين بطاقة دخول إلى روحنا وعالمنا الداخلي.
* عبر التواصل البصري المكثف نربط أنفسنا بالشخص المقابل بصورة عميقة، الأمر الذي يقود إلى حدوث ارتباط روحي وعاطفي عميق وقوي.
* كلما كان التواصل البصري بالنظر عميقًا وكثيفًا، كلما أعطى المحادثة معنى وعاطفة، فنحن عندما نتكلم عن شيء سلبي ننظر بعيوننا بعيدًا.
* الأشخاص الذين ينظرون في العيون يكسبون مصداقية وثقة أكبر وجدارة بالثقة.
* الدراسات تؤكد أنه كلما زادت المحبة بين الشريكين كلما استمر النظر في العيون لفترة أطول.
* النظر في عيون الشخص من الجنس الآخر يولد عنده مشاعر رومانسية.
* عندما ينظر كل من الرجل والمرأة إلى بعضهما البعض بصورة مكثفة ولفترة طويلة يتولد عندهما الشعور بأنهما يعشقان بعضهما البعض، الأمر الذي يقود إلى الهيام.
* فعندما تقول المرأة: إن هذا الرجل يملك عيونًا جميلة فهي لا تعني المظهر الخارجي بل ما يصدر عن هذه العيون.

قواعد وشروط النظر في العيون:
* النظر في العيون يجب أن يكون لطيفًا وحنونًا وممتلئًا بالعاطفة، تجنب الحملقة، كذلك تجنب نظرة الشحاذ.
* أنت يجب أن تبدي للمرأة أنك تنظر إلى أعماقها من خلال عيونها، إلى روحها الداخلية؛ لتكتشف ماذا هناك وتقيمه.
* أنت يجب أن تنظر إليها في عيونها وكأنك تبحر في عالمها الداخلي.
* هذه النظرة تكون أشبه ما تكون إلى نظرة الصائغ إلى قطعة الألماس عندما يريد أن يقيمها.

2. أهمية الابتسامة:
* الابتسامة تجعلنا منفتحين على التواصل مع الأشخاص الآخرين كأشخاص غرباء.
* ابتسم في وجه الآخر وستشعر تلقائيًا أنكما أصبحتما أكثر سعادة.
* الابتسام يحسن المزاج عند الشخص الآخر.
* الناس يعتقدون أنهم معروفون من قبل الشخص الآخر، عندما يبتسم في وجههم فهو يبدو لهم كشخص مألوف.
* غالبًا ما يدفع الابتسام الشخص الآخر على رده والابتسام لنا تلقائيًا.
* الابتسام يحرر عند الشخص الآخر مشاعر إيجابية.
* الشخص المبتسم يبدو كشخص ودود ولطيف ومنفتح في التعامل مع الآخرين.
* الأشخاص المبتسمون يبدون أجمل من الأشخاص الآخرين وينقلون المزاج الجيد إلى الشخص الآخر.
* الابتسامة تجعلنا نشعر بالرضا الداخلي وتجذب الناس إلينا بقوة.

3. أهمية الانتباه إلى وضعية الجسم المفتوح:
* من الملاحظات أن اتخاذ وضعيتين مختلفتين للجسد تحرر في الدماغ تفاعلين كيميائيين مختلفين، وبالمقابل تعود هذه المواد المتحررة لتؤثر على تصرفات الشخص وثقته بنفسه.
* فعلى سبيل المثال: عندما يتخذ جسدك الوضعية المنفتحة، بمعنى آخر عندما تأخذ لنفسك مساحة أكبر في الوقوف والجلوس والمشي (الأرجل المتباعدة، الجسم المنتصب، الرأس المرفوع، الأيدي المتدلية بحرية)، فإن ذلك سيؤدي إلى تغير حالتك النفسية إلى الأفضل. ففي دراسة علمية تم تأكيد أن هذه الوضعية تحفز إفراز كل من هرمون السيروتونين والتيستسترون، واللذان يعطيان المرء الشعور بالجاهزية لاقتحام المخاطر.
* الهرمون الأول (هرمون السيروتونين)، والمعروف بهرمون السعادة، وهو الهرمون المسؤول عن إعطاء الشعور بالثقة بالنفس، من خلال تحفيز إفراز هذا الهرمون في أجسادنا، تتحسن ثقتنا بأنفسنا، يتحسن مزاجنا وتتحسن مقدرتنا على التفاعل الاجتماعي والمحادثة وبناء العلاقات العامة، أما الهرمون الثاني (هرمون التيستسترون) فهو الهرمون المسؤول عن إعطاء الشعور بالقوة والسيطرة.
* وعلى العكس من ذلك تمامًا عندما يتبنى الشخص وضعية أو هيئة الجسم المغلقة (الأيدي المكتوفة، النظر باستمرار إلى الأرض، الظهر المنحني للأمام، فيما يشبه التقوقع على الذات)، فإن ذلك يحفز إفراز (هرمون الكورتيزول), وهو الهرمون المسؤول عن الشعور بالتعب والجهاد والخوف، الأمر الذي يقود إلى توليد الشعور بضعف الثقة بالنفس.
''',
                      style: TextStyle(
                        fontFamily: 'Amiri',
                        fontSize: _fontSize,
                        height: 1.6,
                        color: Colors.black87,
                      ),
                      textAlign: TextAlign.justify,
                    ),
                    const SizedBox(height: 10),
                    // الإعلان الأول
                    if (_isNativeAd1Loaded && _nativeAd1 != null)
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 10.0),
                        child: Container(
                          height: 100,
                          child: AdWidget(ad: _nativeAd1!),
                        ),
                      ),
                    
                    const SizedBox(height: 20),
                    Text(
                      '''
---
### 2. قواعد وتقنيات المحادثة
* قيادة المحادثة بالمديح والإطراء: في لقاء التعارف والمراحل المبكرة من التعارف يقدم الشاب عبارات الثناء والمجاملة مثل: (لديكِ دراية كافية حول الموضوع، ثقافتكِ تبدو واسعة، لديكِ أفكار رائعة، نظرتكِ للأمور واقعية، ذاكرتكِ تبدو قوية، تبدين فتاة طموحة، تبدين ظريفة وخفيفة الدم، لديكِ روح مرحة..... إلخ). دون التطرق للغزل والذي هو عبارة عن مدح مفاتن الجسم وملامحه مثل: (عيونكِ رائعة، ابتسامتكِ جذابة، شعركِ ناعم وجميل)، فمازال الوقت مبكرًا لذلك، ويمكن أن تستجيب له بعض الفتيات بصورة سلبية، في هذه المرحلة المبكرة من التعارف.
* كلما هدأت المحادثة عليك تنشيطها من خلال طرح الأسئلة الواحد تلو الآخر، خصوصًا تلك التي تولد أفكارًا مختلفة ومن خلال الأجوبة، يمكن استنتاج أسئلة وآراء وأحاديث جديدة (فالحوار الطويل يجذب النساء ويولد الألفة معهنَّ)، حاول تحريضها على الحوار من خلال عبارات مثل: ما رأيكِ أنتِ بهذا؟ هل حدث هذا معكِ من قبل؟ كيف كنتِ ستتصرفين لو كنتِ في هذا الموقف؟ اطلب رأيها حول موضوع ما والشيء المهم هو أن تبدو وكأنك مهتم فعلاً بالحصول على رأيها.
* حفز المرأة على الإجابة على أسئلتك بإسهاب، لا تكثر من استخدام الأسئلة المغلقة والتي يكون جوابها بـ: (نعم) أو (لا)، بالمقابل أعطتك المرأة أسئلة أجب أنتَ بإسهاب ولا تستعمل الاقتضاب، إذا كنت تعطي المرأة إجابات مقتضبة فإنها ستقول في نفسها: إذا كان الآن يتكلم هكذا، ماذا سيحدث بعد عام من الزواج وفي أيام العمل الشاق والأزمات، بالطبع لن يتكلم مطلقًا، أو أنها ستفكر أنك تخفي شيئًا ما، مما يجعلها لا تشعر بالأمان نحوك، ويكون ذلك سببًا كافيًا لتركك. حسب دراسات علمية كثيرة من الأزواج يتكلمون مع بعضهم بعد عام من الزواج فقط بضع دقائق في اليوم، وهما لا يشكلان إلا شخصين ما زالا يعيشان بجانب بعضهما البعض.
* أغظها بين الحين والآخر خلال المحادثة كلما سنحت لك الفرصة بذلك، إذا كنت لا تملك دراية واضحة حول هذا الفن من الفكاهة، أنصحك بمتابعة برنامج هيدا حكي للفنان اللبناني عادل كرم، في لقاءاته مع المشاهير خاصة النساء منهم.
* أصغِ إليها باهتمام أثناء الحديث، تفاعل معها في الحديث، اجعل وجهك مليئًا بالتعابير، حافظ على التركيز والاتصال البصري، ابتسم وأعطِ تأكيدات بين الفينة والأخرى مثل: أها، أكيد، احملها على الحديث وأنصت إليها باهتمام.
* استعمال خط الالتقاء، حاول أن تبدي تطابقًا تامًّا في جميع الآراء والأفكار معها، إذا كنت فعلاً تريد التقرب منها وكسب اهتمامها وافقها على كل ما تقول، باستخدام العبارات أو التعابير المناسبة لذلك، مثل: (نعم، صحيح، منطقي، رائع، ممتاز، بالتأكيد، معكِ حق، أنا أرى الأمر كذلك، أنا أشارككِ هذا الرأي أو هذه القناعة).
* استخدام اللغة الغنية بالصور، أي اللغة الوصفية الغنية بالتفاصيل -على سبيل المثال- عندما تروي لها ما حدث معك البارحة وتقول لها: (قرع الجرس، البارحة مساءً بعد منتصف الليل، وقد كنت أغط في نوم عميق، نظرت إلى الساعة المعلقة على جدار الغرفة، كانت الساعة الثانية والنصف بعد منتصف الليل، اعتقدت أن أخي قد نسي المفاتيح وقد عاد متأخرًا من السهرة، نهضت لأفتح الباب.......).
* استخدام المفردات التي تدل على المشاعر، ومن هذه العبارات -على سبيل المثال- (أشعر بأنكِ تحبين قراءة الكتب الأدبية، أتخيل أن مستقبلكِ في المعلوماتية سيكون رائعًا، يراودني شعور بأنكِ تحبين العمل المكتبي، أحس أن شيئًا مميزًا في شخصيتكِ....... إلخ).
---
### 3. الأشياء التي يجب تجنبها في الحوار مع الفتاة

* تجنب المحادثة بأسلوب منطقي، فالنساء تعيش المشاعر، فقط عبر العاطفة تغزو قلوبهنَّ، أنت لا تستطيع أن تقنعها بالمنطق أنك فارس أحلامها.
* تجنب التركيز على الذات واستعراض النفس بشكل مفرط، دعها تتكلم عن نفسها، آرائها وقناعاتها وحفزها على ذلك من خلال طرح الأسئلة والمواضيع المختلفة.
* تجنب الحديث البطيء المتعب -الذي لا يأتي بنهاية- السخافة والسطحية، المجادلة، انعدام التركيز، انعدام المشاعر، قلة الفكاهة (فكل فكاهة تعتبر بمثابة إغراء صغير).
* تجنب الاستعجال وقفز خطوة أو خطوات من مراحل التعارف ولا تنتقل بسرعة من خطوة إلى أخرى، فهذا سيفسد التعارف، فالتعبير عن مشاعر الحب في وقت مبكر يكون خطأ كبيرًا (فالمرأة تريد الرجل على مهل، والوقت بالنسبة لها أمر ضروري ومهم في تعاملها معه وقبوله واستلطافه).
* تجنب الحديث السيء عن الأصدقاء والصديقات، لأن النساء يدون الاحترام الذي يضمره الرجل للمرأة أو التعامل مع الآخرين.
* تجنب الدخول في مواضيع ومناقشتها بصورة جدية مع إبداء شيء من الاختلاف بالرأي.
* تجنب الكلام الذي قد يحوي معنى سلبيًا ضمنيًا أو يفهم بشكل خاطئ والذي تشعر منه المرأة بالإهانة.
* تجنب الحديث فيما قد يفهم على أنه سخرية منها أو من أوضاعها أو من ظروفها، فالإغاظة شيء مختلف تمامًا عن السخرية، وهي نوع من المرح المقترن بالاحترام.
* تجنب الحديث عن الأشياء المملة.
* تجنب الحديث عن السياسة والدين إذا ما كان هناك اختلاف في الرؤى.
* تجنب الحديث المبكر عن التجارب السلبية والشكوى والهموم والمشاكل.
* تجنب التطرق المبكر عن الخصوصيات.
* تجنب الحديث عن المآسي والموت والحروب.
* تجنب الحديث المطول عن المواضيع التي لا تلقى اهتمامًا كبيرًا عند النساء.
* تجنب الضغط عليها حتى لا تعطيها فكرة أنك تريد أن تفرض نفسك عليها بالقوة.
* تجنب أن تشعرها أنك لا تستحقها.
* تجنب الكذب المطلق.
* معظم الرجال يظنون أنهم يؤثرون على المرأة عندما يخبرونها منذ اللقاء الأول كم هي جميلة ورائعة، والحقيقة أن عبارة الغزل والحب لا تأتي في بداية العلاقة، بل بعد مضي فترة من التعارف وبناء الألفة والثقة والأسوأ من ذلك هو عبارات وتلميحات الجنس، وهنا يجب أن أميز بين الإطراء وهو مديح الشخصية والروح، مثل عبارة: تبدين مجتهدة، لديكِ ثقافة واسعة، أنتِ إنسانة حساسة... وغيرها والتي يمكن إلقاؤها دائمًا منذ اللقاء الأول، أما الغزل فهو مديح الجسم ومفاتنه مثل: عيونكِ رائعة، شعركِ جذاب، وجهكِ جميل... وغيرها، فلا يجوز استخدامها في وقت مبكر من العلاقة، كذلك يكون الأمر بالنسبة لعبارات ومشاعر الحب والهيام مثل: لا أستطيع تخيل حياتي من دونكِ، صورتكِ لا تفارق عيوني وغيرها، فلا يجوز استخدامها في مرحلة مبكرة من العلاقة. استمر في إلقاء عبارات الإطراء والمديح خلال المحادثة منذ اللقاء الأول، اختبر قوة العلاقة بينكما بعد مضي 7 - 10 محادثات، أي حوالي أسبوعين إلى ثلاثة والأفضل أكثر من ذلك بمغازلتها بطريقة ما، وانظر هل ستتقبل المغازلة أم لا، أما عبارات ومشاعر الحب فتحتاج إلى وقت أطول ليكون بالمكان إلقاؤها من 10 - 15 لقاء أو محادثة على الأقل أي حوالي شهرين إلى ثلاثة أشهر، يمكن البدء بعبارات الغزل بشكل تدريجي، ثم بعد انقضاء مدة من الوقت يمكن البدء تدريجيًّا بعبارات الحب، والاستمرار فيما بعد بكل من عبارات المديح والإطراء والغزل والحب.
* تجنب طريقة الحوار المسماة بطريقة الشرطي (أي التحقيق) والتي تعتمد على مبدأ طرح الأسئلة السؤال تلو الآخر وانتظار الإجابة.

    مثال:
    * الشاب: منذ كم تعيشين هنا؟ (سؤال)
    * الفتاة: منذ خمس سنوات. (جواب)
    * الشاب: هل أهلكِ أيضاً من القاهرة؟ (سؤال)
    * الفتاة: لا هم من الإسكندرية. (جواب)
    * الشاب: ماذا يعمل أبوكِ؟ (سؤال)
    * الفتاة: يعمل مهندس ميكانيكي. (جواب)
    * الشاب: وأمكِ؟ (سؤال)
    * الفتاة: ربة منزل. (جواب)
    * ”انتهى التحقيق تحال إلى النيابة العامة“

    هذه الطريقة خاطئة مائة بالمائة وتقتل الجاذبية، إن لم يكن الحوار جذابًا، فلن تحظى باهتمام الفتاة، وبالتالي ستكون فرصة الحصول على رقم هاتفها ضعيفة جدًا، إن لم تكن معدومة، والطريقة الصحيحة هي المناوبة بين الأسئلة والأجوبة والتعليقات والفكاهة والنصوص القصيرة المتنوعة والجذابة، فمرة تتكلم أنت ومرة تسأل وتحفزها على الكلام.

    مثال:
    * الشاب: ماذا تعملين؟ (سؤال)
    * الفتاة: أنا مدرسة موسيقى. (جواب)
    * الشاب: مدرسة موسيقى، شيء رائع، أنا من محبي الموسيقى، أنا أستمع للسيدة فيروز باستمرار، صوتها وأغانيها تأخذني إلى عالم الرومانسية والخيال، تستطيعين أن تقولي: إنها مطربي المفضل. (نص قصير)
        ومن هو مطربكِ المفضل؟ (سؤال)
    * الفتاة: شادية. (جواب)
    * الشاب: وما هي أغنيتها المفضلة لديكِ؟ (سؤال)
    * الفتاة: "خلاص مسافر". (جواب)
    * الشاب: شادية أروع إحساس، إنها قريبة من القلب، صوتها الأنثوي الساحر الحنون يسحر كل إنسان يحب أن يسمع الموسيقى، على فكرة هي أيضاً من الأصوات التي أحبها وأتذوق أغانيها. (نص قصير)
        وما هو الشعور الذي يمكن أن ينتابكِ، فيما لو كنتِ تجلسين بجانب المذياع، وفجأة جاءت أغنيتكِ المفضلة "خلاص مسافر"؟ (نص قصير)
    * الفتاة: شعور جميل لا يمكن وصفه. (جواب)
    * الشاب: هل حدث ذلك معكِ من قبل؟ (سؤال)
    * الفتاة: نعم "أغنية مستحيل" للفنانة الراحلة وردة الجزائرية، إنها أيضاً من المطربين المفضلين لدي، وأنتَ هل حدث معك مثل ذلك؟ (سؤال)
    * الشاب: بالتأكيد، كان ذلك بينما كان الطقس ممطرًا وباردًا، أشعلت المدفأة وحضرت الشاي الساخن، أشعلت المذياع، وإذا بأغنية "رجعت الشتوية" للفنانة فيروز، لقد كانت أكثر من رائعة. (نص قصير)
        ولكن قولي لي هل درستِ الموسيقى هنا في القاهرة؟ (سؤال)
    * الفتاة: لا، لقد درستها في الإسكندرية. (جواب)
    * الشاب: إذن أنتِ عندكِ تجربة الحياة في القاهرة والإسكندرية، القاهرة هي العاصمة، بالطبع السكان في العاصمة أكثر عددًا، الازدحام، المواصلات، أما الإسكندرية فهي مدينة بحرية، كم أحب البحر، وأصوات الأمواج المتلاطمة على صخور الشاطئ، نسمات الهواء الدافئة، منظر الغروب، القوارب والسفن. (نص قصير)
        ولكن صحيح أنكِ قلتِ لي إنكِ مدرسة موسيقى، هل تستطيعين العزف على الآلات الموسيقية؟ (سؤال)
    * الفتاة: نعم أستطيع العزف على البيانو. (جواب)
    * الشاب: البانيو!! (فكاهة)
    * الفتاة: ”تضحك“ البيانو.
    * الشاب: آه البيانو، لقد اعتقدت أنكِ تعزفين الموسيقى في الحمام على البانيو، هل تعلمين أن أكثر الفنانين اكتشفوا موهبتهم في الحمام، أنا شخصيًا أغني في الحمام بين الحين والآخر، أمي تقول: إن صوتي جميل. (فكاهة)
    * الفتاة: ”تضحك“ وماذا تغني في الحمام؟ (سؤال)
    * الشاب: أغني أوبرا. (فكاهة)
    * الفتاة: ”تضحك“ وماذا أيضاً؟ (سؤال)
    * الشاب: كل ما يخطر ببالكِ من الأغاني والفلكلور الشعبي. (جواب)
        هل أنتم عائلة كبيرة؟ (سؤال)
    * الفتاة: نحن أربعة إخوة شابان وبنتان. (جواب)
    * الشاب: مع الأهل ستة أفراد، أستطيع القول عائلة ستة نجوم. (فكاهة)
    * الفتاة: ”تضحك“ وأنتم؟ (سؤال)
    * الشاب: سبعة إخوة بنتان وخمسة شباب. (جواب)

الملاحظات على الحوار السابق:
* لاحظ استخدام مزيج من اللغة الوصفية مثل (الأمواج المتلاطمة على صخور الشاطئ) واللغة المشاعرية مثل (من الأصوات التي أحبها وأتذوق أغانيها) والفكاهة مثل (اعتقدت أنكِ تعزفين الموسيقى في الحمام على البانيو).
* حاول أن تنشئ حوارات مماثلة، لاحظ كم يكون للكلمات من معانٍ عندما تعبر عن الأشياء باستخدام الحركات التمثيلية من خلال لغة جسدك -على سبيل المثال- عندما تقول العبارة الواردة في نص الحوار: شادية أروع إحساس، إنها قريبة من القلب، وأنت تشير في هذه اللحظة بيدك اليمنى إلى صدرك ناحية القلب. تعود أن تعبر عن الأشياء من خلال كلتا اللغتين، اللغة الشفوية ولغة الجسد، لا تقف وأنت مكتوف الأيدي، عندما تتكلم عبر عن الفكرة التي تقولها من خلال تعابير وجهك ولغة جسدك أيضاً.
* لاحظ أيضاً من خلال الحوار السابق أن الفتاة غالبًا ما تجيب في البداية باقتضاب ونادرًا ما تسأل، وهذا أمر طبيعي ولكن رويدًا رويدًا تبدأ بالأسئلة وتبدأ تسهب في الإجابة.
* لاحظ أيضاً من خلال الحوار السابق أننا نأخذ كلمة من إجابة الفتاة ونبني عليها موضوعًا جديدًا أو نصًّا قصيرًا أو حتى سؤال جديد وبذلك نجد أنفسنا أمام حالة وفيرة من المواضيع والأفكار والأسئلة.
* بالطبع يوجد تقنيات أخرى لدفع المرأة لمتابعة المحادثة لأطول فترة ممكنة، فإطالة المحادثة أمر في صالحك، ادفعها للحديث عن نفسها أكثر فأكثر، ومن هذه التقنيات:
    * تقنية الارتداد: (أنت تجيب على سؤالها وتعيد عليها الدور بالكلام من خلال طرح سؤال عليها).
        * هي تسأل: هل تقرأ الروايات الأدبية؟
        * أنت تجيب: بالطبع، أنا أقرأ روايات كثير من الأدباء خصوصًا روايات أجاثا كريستي، هل سبق لكِ أن قرأتِ شيئًا من رواياتها؟
    * تقنية التخمين: (التخمين يدفع الشخص الآخر لتأكيد اعتقادك أو نفيه أو تصحيحه).
        * أنت تقول لها: أعتقد أن الخبرات التي كونتها في دورة التأهيل في الخارج ستعود بفائدة عظيمة وحاسمة لأجل مستقبلكِ المهني، أليس كذلك؟
''',
                      style: TextStyle(
                        fontFamily: 'Amiri',
                        fontSize: _fontSize,
                        height: 1.6,
                        color: Colors.black87,
                      ),
                      textAlign: TextAlign.justify,
                    ),
                    const SizedBox(height: 10),
                    // الإعلان الثاني
                    if (_isNativeAd2Loaded && _nativeAd2 != null)
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 10.0),
                        child: Container(
                          height: 100,
                          child: AdWidget(ad: _nativeAd2!),
                        ),
                      ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
      bottomNavigationBar: const BannerAdWidget(),
    );
  }
}